Функция ЗначениеВСтрокуJSON(Значение) Экспорт
    Значение1 = Значение;
    Если ТипЗнч(Значение) = Тип("ТаблицаЗначений") Тогда
        Значение1 = ОбщегоНазначения.ТаблицаЗначенийВМассив(Значение);
    КонецЕсли;
    Запись = Новый ЗаписьJSON;
    Запись.УстановитьСтроку();
    ЗаписатьJSON(Запись, Значение1,,"ПростаяФункцияПреобразованияJSON", МодульJSON);
    Возврат Запись.Закрыть();
    
КонецФункции

Функция ПростаяФункцияПреобразованияJSON(Свойство,Значение,ДополнительныеПараметры, Отказ)
    Если ОбщегоНазначения.ЭтоСсылка(ТипЗнч(Значение)) Тогда
        Возврат XMLСтрока(Значение);
    КонецЕсли;
КонецФункции